// Створити і відобразити заголовок з текстом "привіт, світ" червоного кольору

const heading = document.createElement('h3');
heading.append('Привіт, світ');
heading.classList.add('red-text');

const root = document.querySelector('#root');
root.append(heading);

// DOM - document object model

/*
React - фреймворк/бібліотека, яка полегшує розробку user interfaces (браузерної фронтової частини проєкту)

Фреймворк - програмна платформа, яка полегшує розробку і забезпечує компонентний підхід до розробки великиї проєктів

Бібліотека - набір функцій/програм, який призначений для вирішення певного набору задач



*/


/*
Таска: вилити з чашки 50мл чаю

ООП: 
Об'єкт чашка має метод "нахилити", в процесі якого виливається чай

Функціональне програмування:
функція нахилу приймає дані, пов'язані з чашкою в якості аргументів і здійснює виливання

Декларативне програмування:
чашка має бути нахилена і з неї вилились задані 50мл чаю



*/