/*
Зробити ToDoList

Форма для вводу тексту + кнопка відправки
Коли користувач вводить нову справу, відправляє її, вона з'являється в списку справ

* (після відправки тексту очистити форму, і не вносити в список "пусті" рядки)

1. Розділення на компоненти має відповідати принципу єдиної відповідальності

2. Завдання мінімум: 
	на сторінці має бути форма, кнопка, список в який додаються елементи
	
	2 частина:
		кожен елемент має галочку виконаного завдання
		(справа може бути виконана, а може бути невиконана)
	3 частина:
		кожен елемент має кнопку видалення
Опціонально: переробити список таким чином, щоби він складався з двох списків:
список ще не виконаного			список виконаних справ

і після виконання справи (чекання чекбокса) справа переміщується в список виконаних

*/