import React from 'react';


 function App (props) {

  const user = {
    firstName: 'John',
    lastName: 'Doe',
     age: 18
  }

// const h1 = React.createElement('h1', {}, `Hello, ${user.firstName}`);
// return h1;

    return <h1>Hello, {user.firstName}</h1>   // JSX-синтаксис

}


export default App;


/*
Компоненти в React - це блок коду (функція, наприклад), який створює і повертає react-елементи

Компоненти бувають двох типів:
- Функціональні - це звичайна JS-функція, яка повертає створений react-елемент
- Класові - це клас, який наслідується від React.Component і описувати шаблон компоненти, яка має бути в інтерфейсі

*/



/*
Рендер - процес відмальовування (отрисовки) елементів на сторінці браузера.
(re-render - перемальовування, оновлення)

Браузер оновлює елементи на екрані (ререндерить сторінку) в той момент, коли стек пустий


*/