/*
<Calendar /> - містить стан з поточним днем і керує контекстом
    <CurrentDay /> - має показувати поточний день, якщо календар тільки відкрито, якщо день міняється - то мав висвітитись інший, актуальний, обраний користувачем
    <CalendarBody /> - керує рендером таблиці та заголовками тижнів
        <table>
            <thead>
            <tr>(['S', 'M', 'T', 'W', 'T', 'F', 'S']).map((letter) => <td>{letter}</td>)</tr>
            </thead>
            <tbody>
                 <Month />
            </tbody>

      <Month /> -> рендерить тижні
            кількість тижнів в місяці - getWeeksInMonth()
        <Week /> - має знати, коли він починається
       startOfWeek = parse('year', 'week', new Date())

            кожен тиждень = 7 днів
            new Array(7) -> заповнити компонентами <Day /> (в пропсах startOfweek + індекс дня в масиві)
 
        <Day />
            - має знати, що вона за день
            - рендерить день, за який він відповідає
            - якщо день не входить в поточний місяць - не рендеримо
            - має стан "звичайного дня" та "виділеного дня"
            - при натисненні на день він має "обратись" -> маємо змінити currentDay в контексті
*/